docs/posts/2016-06-08-pull-quotes.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 28, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Pull Quotes</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Pull Quotes</h1>
<p class="subtitle" role="doc-subtitle">Jun 08, 2016</p>
</header><p>
Here is my attempt at pull quotes in the Lanyon/Poole theme for Jekyll:
</p>


<pre class="example" id="org0bf29e7">
.pquote {
    float: right;
    width: 15rem;
    color: #979797;
    font-size: 1.5rem;
    line-height: 1.8rem;
    font-style: italic;
    padding: 1rem;
	quotes: "\201C""\201D""\2018""\2019";
}
</pre>

<p>
I just learned that Kramdown makes it easy to specify classes and attributes. So, this produces the pull quote:
</p>

<pre class="example" id="org34116b4">
&gt; This is some quoted text.
{:.pquote}
</pre>


<p>
It is easy to add quotation marks automatically, using the &ldquo;before&rdquo; and &ldquo;after&rdquo; class selectors. I decided not to do this for the sake of flexibility.
</p>


<div class="tagline" id="orgdb85f5a">
<p>
Tagged: <a href="../tags/misc.html">Misc</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 28, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
